{"pages":[{"title":"Over mezelf","text":"Lees en je vindt uit wat me bezig houdt. Ik hou van wetenschap en techniek in het algemeen en ben er ook in gevormd. Ik hou van programmeren. Ik deed het al toen ik tiener was. Ik schreef niet-triviale dingen in assemblers, Basic, Pascal, C, C++, Perl, Python, Javascript en zelfs sommige hardware beschrijvingstalen zoals Verilog en VHDL. Muziek is mijn andere liefde. Van Abba tot Bach. Misschien wat voorbehoud voor opera.","tags":"pages","url":"pages/about-me.html"},{"title":"Heb ik nog genoeg stookolie ?","text":"Koud als het is peilde ik daarnet of we nog wel genoeg stookolie hebben om ons de volgende weken te kunnen verwarmen. Maar wacht, ik meet een hoogte in een cilindrische tank ! Ik weet wel dat het een tank is van drieduizend liter. En dat hij 120cm diameter heeft. Maar hoeveel stookolie zit er nu in als ik 25cm peil ? Vind het hier uit ! Geen wiskunde alstublieft ! Die wiskunde interesseert je geen knijt, maar je zou het ook wel willen weten voor je cilindrische tank ? Vul dan onderstaande gegevens in en ik bereken het wel even voor je. function Bereken() { var Peil = $( '#PeilHoogte' ).val() var Diameter = $( '#DiameterTank' ).val() var Inhoud = $( '#InhoudTank' ).val() var X = ( Peil - Diameter / 2 ) / ( Diameter / 2 ) var Alpha = Math.asin(X) if ( isNaN( Alpha ) ) { $( '#Resultaat' ).html( 'De gegevens lijken mij niet juist ingevuld. Of misschien ben je wel aan grondsanering toe ?' ) } else { var Fraction = ( Math.PI / 2 + 0.5 * Math.sin( 2 * Alpha ) + Alpha ) / Math.PI var Resterend = Math.round( Fraction * Inhoud ) var Vullend = Inhoud - Resterend $( '#Resultaat' ).html( 'Je tank bevat nog ' + Resterend + ' liter stookolie. Je kunt ' + Vullend + ' liter bijvullen.' ) } } Inhoud in liter van de tank : Diameter in cm van de tank : Peilhoogte in cm : Je tank bevat nog 453 liter stookolie. Je kunt er 2547 liter bijvullen. Geef me toch maar de wiskunde ! De berekening hiervan is niet zo moeilijk en kan met wiskunde uit het middelbaar onderwijs. Uiteraard zijn er wel een aantal vereenvoudigingen. Ik ga er van uit dat de tank een perfecte cilinder is, die ook perfect horizontaal ligt. In werkelijkheid zijn er doorgaans welvingen op de koppen, maar die introduceren geen al te grote fout. De uitleg is aan de hand van deze tekening. De verhoudingen zijn gereduceerd tot een cirkel met straal 1. Veronderstel dat het peil boven de helft staat zodat een hoek `alpha` wordt gevormd tussen de horizontale middellijn en de stand van de stookolie. `alpha` drukken we uit in radialen ( `2*pi` radialen in een cirkel ). Rechts boven is dan een oppervlakte die bestaat uit het cirkelsegment en een rechthoekige driehoek. De rechthoekige driehoek heeft als zijden `sin(alpha)` en `cos(alpha)`. Zijn oppervlakte is dus `1/2*sin(alpha)*cos(alpha)`. Het cirkelsegment heeft als oppervlakte `pi/2*alpha`. Rechtsboven staat dus een gearceerde oppervlakte van : `1/2*sin(alpha)*cos(alpha)+alpha/2` Links boven is de oppervlakte wegens symmetrie dezelfde. Er staat dus een oppervlakte `sin(alpha)*cos(alpha)+alpha` boven de helft. Onder de helft uiteraard `pi/2`. De oppervlakte gevuld door de stookolie ( na de verhoudingen tot een cirkel met straal 1 te hebben gereduceerd) is dus : `pi/2+alpha+sin(alpha)*cos(alpha)`. Met `I` de totale inhoud van de tank is de resterende inhoud dus : `I * ( pi/2+alpha+sin(alpha)*cos(alpha) )` Als de stookolie onder de helft gaat wordt `alpha` negatief en ook `sin(alpha)*cos(alpha)`, m.a.w. de formule blijft opgaan onder de helft. Blijft de vraag hoe aan `alpha` te komen. We zien dat `sin(alpha)` de peilhoogte is, waarbij -1 leeg is, 0 halfweg en +1 vol. Daaruit volgt dat, met `R` de straal van de tank en `P` de peilhoogte : `alpha = sin&#94;-1( ( P - R ) / R )`","tags":"Wiskunde","url":"posts/genoeg-stookolie.html"},{"title":"Het antwoord is `e&#94;pi`","text":"Kreeg je ze ook al eens in één of andere test ? De vraag welk getal volgt in de rij 1, 1, 2, 3, 5 ? Je wordt dan verondersteld '8' te antwoorden. Omdat elk getal de som is van zijn 2 voorgaande ( de rij van Fibonacci ). Welnu, dat is een weinig creatief antwoord. Je kruipt in de gedachtengang van de vraagsteller, terwijl er letterlijk oneindig veel andere mogelijkheden zijn. Logische mogelijkheden. Laten we zeggen dat het volgende getal `e&#94;pi` is ! En aantonen natuurlijk. Veelterm Een mogelijke aanpak is met veeltermen. Beschouw de veelterm : `f(x)=a_5*x&#94;5+a_4*x&#94;4+a_3*x&#94;3+a_2*x&#94;2+a_1*x+a_0`. Daarbij werd voor een vijfde graad gekozen omdat er al 5 getallen zijn gegeven, dat wordt later duidelijk. `x` zal staan voor de positie in de rij. 0 voor het eerste getal, 1 voor het tweede ... 4 voor het vijfde. Toegepast op onze rij hebben we nu : `f(0)=1`, `f(1)=1`, `f(2)=2`, `f(3)=3`, `f(4)=5`. Het volgende getal in de rij kennen we niet maar laten we het `alpha` noemen. Dan `f(5)=alpha`. 6 vergelijking met 6 onbekenden Wanneer we nu bovenstaande uitschrijven zien we dat we 6 vergelijkingen hebben met 6 onbekenden `a_0` .. `a_5` : `a_5*0&#94;5+a_4*0&#94;4+a_3*0&#94;3+a_2*0&#94;2+a_1*0+a_0 = 1` `a_5*1&#94;5+a_4*1&#94;4+a_3*1&#94;3+a_2*1&#94;2+a_1*1+a_0 = 1` `a_5*2&#94;5+a_4*2&#94;4+a_3*2&#94;3+a_2*2&#94;2+a_1*2+a_0 = 2` `a_5*3&#94;5+a_4*3&#94;4+a_3*3&#94;3+a_2*3&#94;2+a_1*3+a_0 = 3` `a_5*4&#94;5+a_4*4&#94;4+a_3*4&#94;3+a_2*4&#94;2+a_1*4+a_0 = 5` `a_5*5&#94;5+a_4*5&#94;4+a_3*5&#94;3+a_2*5&#94;2+a_1*5+a_0 = alpha` Of onder matrix vorm : `( (1,0,0,0,0,0) , (1,1,1,1,1,1) , (1,2,2&#94;2,2&#94;3,2&#94;4,2&#94;5) , (1,3,3&#94;2,3&#94;3,3&#94;4,3&#94;5) , (1,4,4&#94;2,4&#94;3,4&#94;4,4&#94;5) , (1,5,5&#94;2,5&#94;3,5&#94;4,5&#94;5) )*((a_0),(a_1),(a_2),(a_3),(a_4),(a_5))=((1),(1),(2),(3),(5),(alpha))` Zoals we weten moeten we om dit oplossen de matrix inverteren. De matrix, die een inverteerbare Vandermonde matrix is, kan wellicht manueel worden geïnverteerd. Ik gebruikte echter www.wolframalpha.com . Het resultaat voor de inverse matrix is : `1/120*((120,0,0,0,0,0),(-274,600,-600,400,-150,24),(225,-770,1070,-780,305,-50),(-85,355,-590,490,-205,35),(15,-70,130,-120,55,-10),(-1,5,-10,10,-5,1))` Bijgevolg is de oplossing voor het stelsel : `((a_0),(a_1),(a_2),(a_3),(a_4),(a_5))=1/120*((120,0,0,0,0,0),(-274,600,-600,400,-150,24),(225,-770,1070,-780,305,-50),(-85,355,-590,490,-205,35),(15,-70,130,-120,55,-10),(-1,5,-10,10,-5,1))*((1),(1),(2),(3),(5),(alpha))` Of uitgewerkt : `((a_0),(a_1),(a_2),(a_3),(a_4),(a_5))=1/120((120),(-424+24*alpha),(780-50*alpha),(-465+35*alpha),(120-10*alpha),(-11+alpha))` Terug naar de veelterm De oorspronkelijke veelterm , opgelost naar `a_i` is dus : `120* f(x) = ` `120 + (-424+24*alpha)*x` `+ (780-50*alpha)*x&#94;2` `+ (-465+35*alpha)*x&#94;3` `+ (120-10*alpha)*x&#94;4` `+ (-11+alpha)*x&#94;5` Hiervoor geldt inderdaad : `f(0)=1` `f(1)=1` `f(2)=2` `f(3)=3` `f(4)=5` `f(5)=alpha` Bemerk hoe voor 0..4 de afhankelijkheid van `alpha` volledig verdween ! Wat betekent dit ? We hebben dus een veelterm gedefinieerd die voor x=0..4 de oorspronkelijke rij 1, 1, 2, 3, 5 genereert en voor het volgende getal (x=5) een willekeurig getal `alpha`. Noteer dat `alpha` niet eens geheel, rationaal of zelfs maar reëel moet zijn ! Met andere woorden `e&#94;pi` is een even geldig antwoord als 8 ! En verder ... Noteer dat deze veelterm een andere rij definieert dan de Fibonacci rij. Zelfs voor `alpha=8`. De twee rijen vallen juist samen voor de eerste 6 getallen. Deze veelterm rij, bvb, heeft als eigenschap dat `f(6)=-40+6*alpha`. Dus met `alpha=8` is ook het volgende getal in de rij 8 ! En niet 13 zoals in de Fibonacci rij. Merk verder ook op dat niets in deze aanpak specifiek is voor de Fibonacci rij. Ik nam ze puur als voorbeeld. Met deze techniek kun je dus om het even welke rij vervolledigen met een 'logische' oplossing `e&#94;pi`. De enige voorwaarde is dat de matrix inverteerbaar is. Maar dat is altijd het geval voor de Vandermonde matrices die op deze manier tevoorschijn komen.","tags":"Wiskunde","url":"posts/het-antwoord-is-e-to-pi.html"}]}